{
    "version": "https://jsonfeed.org/version/1",
    "title": "Learningweaver",
    "description": "",
    "home_page_url": "https://learningweaver.com",
    "feed_url": "https://learningweaver.com/feed.json",
    "user_comment": "",
    "icon": "https://learningweaver.com/media/website/logo-dark.png",
    "author": {
        "name": "Madhur Anand"
    },
    "items": [
        {
            "id": "https://learningweaver.com/how-long/",
            "url": "https://learningweaver.com/how-long/",
            "title": "How long and deep should a learning journey be?",
            "summary": "<p>You have got hands on a shiny new journey designer like Learningweaver. Now you want to make a journey with multiple learning milestones quickly.</p>\n",
            "content_html": "<p>You have got hands on a shiny new journey designer like Learningweaver. Now you want to make a journey with multiple learning milestones quickly.</p>\n\n<p>As a learning designer, one of the big design questions you face is how long a learning journey should be. The second question is, how many components should it ideally have, for example, in every milestone or every week? Some educators believe in maximizing and making a learning plan as comprehensive as possible. The adage which inspires others is - less is more. So, which one to follow?</p>\n<p>Conventionally, the length of a learning program is decided by the budget, learning objectives, number of learning units, or simply by the availability of time with the learners or organizers. While training for competencies or soft skills, deciding this becomes even more mysterious because good practice is crucial for effective learning.</p>\n<p>Physical programs are limited by the amount of continuous time that organizers, trainers, and learners can afford. On the other hand, blended learning benefits from the spaced learning approach. Since learning is to blend with other areas of a learner’s life, unlike in a classroom contact paradigm, gaining learner engagement also depends on the right length and mix of learning components.</p>\n<figure class=\"post__image post__image--left\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/22/mahdis-mousavi-hJ5uMIRNg5k-unsplash-3.jpg\" sizes=\"(max-width: 1200px) 100vw, 1200px\" srcset=\"https://learningweaver.com/media/posts/22/responsive/mahdis-mousavi-hJ5uMIRNg5k-unsplash-3-xs.jpg 300w ,https://learningweaver.com/media/posts/22/responsive/mahdis-mousavi-hJ5uMIRNg5k-unsplash-3-sm.jpg 480w ,https://learningweaver.com/media/posts/22/responsive/mahdis-mousavi-hJ5uMIRNg5k-unsplash-3-md.jpg 749w ,https://learningweaver.com/media/posts/22/responsive/mahdis-mousavi-hJ5uMIRNg5k-unsplash-3-xl.jpg 1200w\"  alt=\"\" width=\"400\" height=\"600\"></figure>\n<p> </p>\n<p><strong>Evidence from research</strong></p>\n<p>Researchers from the University of Amsterdam have examined social skills training(SST) programs for children and teenagers to understand the duration and components most effective.</p>\n<p>De Mooij et al. (2020) published a multilevel meta-analysis of 60 different SST programs. Their results showed that SST programs positively affected the development of interpersonal and emotional skills in nonclinical samples: d = .369, 95% CI [.292, .447], p &lt; .001. This effect was positively influenced by the inclusion of psychoeducation and skill-building components. The inclusion of psychophysical components and the number of cognitive-emotional components did not influence program effects.</p>\n<p>They found a curvilinear relationship between intensity, duration, and effect size:</p>\n<ol>\n<li>Programs including 3 to 6 psychoeducational exercises and programs with 11 to 20 skill-building activities outperformed programs with more or fewer exercises in respective components.</li>\n<li>Program duration of 10-16 weeks has the most considerable effect compared to a longer or shorter term.</li>\n</ol>\n<figure class=\"post__image post__image--center\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/22/priscilla-du-preez-XkKCui44iM0-unsplash.jpg\" sizes=\"(max-width: 1200px) 100vw, 1200px\" srcset=\"https://learningweaver.com/media/posts/22/responsive/priscilla-du-preez-XkKCui44iM0-unsplash-xs.jpg 300w ,https://learningweaver.com/media/posts/22/responsive/priscilla-du-preez-XkKCui44iM0-unsplash-sm.jpg 480w ,https://learningweaver.com/media/posts/22/responsive/priscilla-du-preez-XkKCui44iM0-unsplash-md.jpg 749w ,https://learningweaver.com/media/posts/22/responsive/priscilla-du-preez-XkKCui44iM0-unsplash-xl.jpg 1200w\"  alt=\"\" width=\"800\" height=\"533\"></figure>\n<p> </p>\n<p><strong>Implications</strong></p>\n<p>You might wonder if this can be generalized for our purpose. This study examines the social skills training of adolescents. Adolescents face a dynamic social environment where they must gain social skills to thrive, avoid bullying and communicate and relate effectively with peers. It seems similar to what employees might face in today’s dynamic business environment.</p>\n<ul>\n<li>The above research study suggests that having an optimum effect follows a curvilinear relationship with duration and intensity (number of components). So maybe both, less is more and going the extra mile, are valid for learning.</li>\n<li>Psychoeducation exercises map to conceptual &amp; theoretical components of your training programs. A helpful heuristic could be to have 3-6 such activities per program. For skill-building, the thumb rule could be to have 10-20 activities per program.<br><br></li>\n<li><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Regarding duration, 10-16 weeks give higher engagement and effective spaced learning. Learning experts at <a href=\"https://skills.cafe\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Skillscafe</a> also suggest a sweet spot of 8-12 weeks.<br></span></li>\n<li><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Another idea that this study found was that some components, even though they are widely practiced, were not so effective. So, it might be a good idea to regularly assess and remove activities that might not engage the learners and dilute the effect.</span></li>\n</ul>\n<p> </p>\n<p><strong>References:</strong></p>\n<p>de Mooij, B., Fekkes, M., Scholte, R.H.J. <em>et al.</em> Effective Components of Social Skills Training Programs for Children and Adolescents in Nonclinical Samples: A Multilevel Meta-analysis. <em>Clin Child Fam Psychol Rev</em> <strong>23</strong>, 250–264 (2020). <a href=\"https://doi.org/10.1007/s10567-019-00308-x\">https://doi.org/10.1007/s10567-019-00308-x</a></p>\n<p> </p>\n<p>Image Credits:</p>\n<p>Photo by <a href=\"https://unsplash.com/@dissii?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">mahdis mousavi</a> on <a href=\"https://unsplash.com/?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a> </p>\n<p>Photo by <a href=\"https://unsplash.com/@priscilladupreez?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Priscilla Du Preez</a> on <a href=\"https://unsplash.com/?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a> </p>\n<p>Photo by <a href=\"https://unsplash.com/@austindistel?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Austin Distel</a> on <a href=\"https://unsplash.com/?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a> </p>",
            "image": "https://learningweaver.com/media/posts/22/austin-distel-wD1LRb9OeEo-unsplash.jpg",
            "author": {
                "name": "Madhur Anand"
            },
            "tags": [
                   "blog"
            ],
            "date_published": "2022-10-16T12:02:33+05:30",
            "date_modified": "2022-10-16T12:02:33+05:30"
        },
        {
            "id": "https://learningweaver.com/what-is-blended-learning/",
            "url": "https://learningweaver.com/what-is-blended-learning/",
            "title": "What is blended learning?",
            "summary": "<p>Learning experience design is a hot topic, and there are always new tools coming up. Work and learning, both are going hybrid. The 3-star standard of learning is to make it efficient, effective and enjoyable (Neelen &amp; Kirschner, 2020). <br><br></p>\n",
            "content_html": "<p>Learning experience design is a hot topic, and there are always new tools coming up. Work and learning, both are going hybrid. The 3-star standard of learning is to make it efficient, effective and enjoyable (Neelen &amp; Kirschner, 2020). <br><br></p>\n\n<p>Just like we focus on the UI and UX on our products so much we need to focus on LI and LX – the learning interface and the learner experience. How is it similar to user – engagement is a key metric, and so a learning product which keeps learners hooked, might be a good contender for high engagement, but we have to see why the engagement is high – is it just because the content is enjoyable? Or is it also effective? Revisiting it again quite important.</p>\n<p>Learning doesn’t happen in one session. It is a journey and benefits from a process oriented approach. The a priori knowledge and goals of the learner play a key role in choosing the route on the map of the learning domain. Think of blended learning like a multi-media art or a trialathon – both aim at evoking human excellence but use multi-modes to get there.</p>\n<p>Covid-19 has accelerated the adoption and demand for digital transformation everywhere, including the field of learning and development. Teams are now hybrid and distributed across cultures and time zones. <br><br>Executives are looking to digital transformation for innovation, cost savings and the increased productivity required to stay relevant in the marketplace. But while ed-tech capabilities are advancing every day, many practitioners are struggling to make sense of when and how to leverage these new modalities.</p>\n<p>When learners engage with the right blend of tools and content, structured in the right way, they learn faster and more effectively—and the skills or knowledge they build become deeply embedded.</p>\n<p>Siemens et al. (2015) report in a systematic review that all of the evidence-based studies conclude that student achievement was higher in blended learning experiences when compared to either fully online or fully face-to-face learning experiences.</p>\n<h1>Definition</h1>\n<p> </p>\n<p><strong>Blended learning</strong>, also known as hybrid learning, web-enhanced instruction, or mixed-mode instruction, is an approach to education that combines online educational materials and online interaction with live or physical sessions.</p>\n<p>We cannot track learning directly – so we use the proxy of engagement and proficiency. Engagement defines how much attention people were paying, what is the completion rate, how many time people re-visited the content etc. etc.</p>\n<p>Proficiency is usually measured by use of tests or situations where learner has to apply the skill/knowledge in a real-life or sample use case.</p>\n<p> </p>\n<h1>The Need</h1>\n<ol>\n<li><strong>Age of distraction:</strong> Many learners (especially millennials and Gen-Z) are not content to sit for long periods in a classroom—or even at their computer— listening to or reading dense training materials. In the absence of a highly engaging learner experience, they face high temptation to multitask instead of focusing on the training.</li>\n<li><strong>Humans are social:</strong> Online learning performs poorly in isolation. Learners are seeking social interaction in their learning experiences. More than half of each generation in a recent LinkedIn Learning study said they value the ability to collaborate with instructors and other learners via forums, groups, or Q&amp;A sessions. (“3 rd Annual 2019 Workplace Learning Report,” LinkedIn Learning, 2019)</li>\n<li><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">Always-on learning</strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: Across all ages, learners want access to learning content at the time of their convenience. The need for just-in-time access to material is coming out strongly. For eg: before a presentation, a meeting or sales call etc.</span></li>\n<li><strong>Emotional pull</strong>: Amidst the proliferation of media and tools, on-the-job training or instructor-led training is still important and is to be enhanced using technology. Live interactions by nature involve emotions. Good facilitators consciously create a learning environment that evokes the emotions that are most helpful in the learning process.</li>\n<li><strong>Importance of presence:</strong> The trainer/leader needs to be present, if the instructor can’t be present how will it motivate learners to work on collaboration and teamwork</li>\n<li>Face to face or live session promote building of relationships which important for engagement and mutual accountability – especially important in leadership and soft skills settings.</li>\n</ol>\n<p>Learners need to apply the new skills in daily life. To be able to do this they have to truly master their applied knowledge of the skills in a sustained manner. Digital environments offer lot more practice space for this real-life application in the sustenance phase of any learning journey.</p>\n<p> </p>\n<h1>Models</h1>\n<p> </p>\n<p>At the heart of effective blended learning design is the learning journey. Creating a blend is as much of an art and as much of science. Just like a good recipe or good music? The process should be evidence-informed and based learning designer’s experience.</p>\n<p>Neelen &amp; Kirschner (2020) share some key lessons from learning science about designing engaging learning journeys.</p>\n<ol>\n<li>Focus on learning transfer and not just on comprehension</li>\n<li>Include opportunities of reflection</li>\n<li>Build on prior knowledge</li>\n<li>Create learning environment</li>\n<li>Focus on learning and instruction – not just on instruction</li>\n<li>Focus on deeper conceptual understanding and first principle thinking</li>\n</ol>\n<p> </p>\n<p>Choosing the appropriate model based on your learner demographic, context and setting is crucial for success. Following are some models of blended learning for you to consider while designing:</p>\n<p> </p>\n<ul>\n<li><strong>Gamification: </strong>Letting learners play is a reliable way of motivating learners. By using game play elements such as points or levels, learners feel a little competition and are more motivated to experience the material on their own time.</li>\n<li><strong>Online Lab:</strong> This blended learning model is entirely digital, with little or no instructor interaction, and takes place either before, during or after a training. Learners can access content on mobile phones, laptops or tablets. This modality engages and solidifies learning.</li>\n<li><strong>Self-Blend:</strong> Self-blended learning is supplemental content—either in the form of webinars, white papers, industry blogs, or video tutorials—that help self-motivated learners delve deeper into a subject. A robust LMS can combine diverse content sources under one system to encourage curiosity and growth.</li>\n<li><strong>Online Driver: </strong>Entirely self-directed, this model takes place in a digital environment. Learners can engage with an instructor through chat, email or message board. It provides a flexible schedule and personalized learning, but lacks the face-to-face interaction of other types of blended learning. An LMS is the best way to encourage users to direct their own learning while still monitoring their process as they enjoy media and eventually, engage in classroom discussion.</li>\n<li><strong>Flex Model</strong> – Most of the curriculum is delivered via a digital platform and teachers/instructor are available for face-to-face consultation and support.</li>\n</ul>\n<p> </p>\n<h1>Components</h1>\n<p>Blended learning happens when we combine live physical learning events with digital counterpart. The digital platform like learning weaver provides a scaffolding for the learner to contextualize their learning environment. In today’s hybrid world it is important to create a room or a space where the learning experience is placed and hosted. Mind you it doesn’t need to become a social network and doesn’t need to foster more than required engagement among the learners. For that learners already have a lot of tools. Instead, this needs to be focused space where the learners can just be with the facilitator or leader and engage with the material.</p>\n<p>The gamification or the leader board provides the social angle to the learning it creates the motivation and urgency to master and engage in the material. Without it the self-paced nature might be good for some highly motivated learners but for others it might become something which they sign on but never use it back again.</p>\n<p>Blended learning combines traditional learning tools and content with modern methodologies. Some of these include:</p>\n<ol>\n<li>Games and interactive scenarios</li>\n<li>Physical workshops and classroom sessions</li>\n<li>Webinars and virtual classrooms</li>\n<li>Digital learning courses (eLearning) and micro-modules</li>\n<li>Mobile delivery of on-the-job training</li>\n<li>Instructor/Facilitator Feedback</li>\n<li>Peer Reflection Circles</li>\n<li>Discussion forums &amp; Peer communication</li>\n<li>Virtual Reality (VR) experiences</li>\n<li>Augmented Reality (AR) apps</li>\n<li>Video and rich media</li>\n<li>Podcasts</li>\n<li>Chatbots and smart search tools</li>\n<li>Infographics and resource packs</li>\n<li>Spaced learning and spaced repetition</li>\n<li>Time-bound assignments</li>\n<li>Milestone / Key-stone projects</li>\n<li>Action Plans</li>\n<li>Gamification and Leaderboard</li>\n<li>Case Studies</li>\n</ol>\n<p> </p>\n<h1>What is not blended learning design?</h1>\n<p> </p>\n<ol>\n<li>It’s not about replacing the instructor/facilitator with an online software. It is about enhancing and adding more ways of interacting with the teacher and the material</li>\n<li>The ideal use of blended learning is if the learning is spaced, however, learners might use it to cram all the items together which is not a good idea. In that way scheduled learning helps in breaking up the material.</li>\n<li>Blended courses include a mix of both face-to-face, instructor-led learning, and online or digital course components that give students some control over path and pace. Blended learning is not a completely online course or a lecture course that is broadcast online. It also does not include course changes that simply swap analog tools for digital ones. In blended learning, the in-person and online elements work together to create a richer learning experience and do not simply duplicate course content in varying formats.</li>\n</ol>\n<p> </p>\n<h1>Advantages</h1>\n<p>It’s important to understand that employees/participants are balancing the learning with many other competing priorities. This can result in learning taking a backseat to more urgent tasks.</p>\n<p>Effective blended learning solutions not only maintain but deepen learner engagement over time, and integrate learning directly into the flow of work.</p>\n<p>There are many advantages to creating blended learning journeys:</p>\n<ol>\n<li>Provide a context to learning\n<ol>\n<li>Often in adult learning situations, the learning events become spread out and sporadic without much structure, you take one workshop this month, read another work next week and maybe engage in some other activity next quarter. A blended learning journey can help weave all these separate learning events together and create a structure to contextualize the learning</li>\n</ol>\n</li>\n<li>Use the power of spaced learning\n<ol>\n<li>In the traditional model it is difficult to space out learning and the tendency is to cram multiple modules/content in a small duration of a few hours to few days.</li>\n<li>Even for those with regular classes like dance classes, this can help to create a guiding context where learners can keep their readings, assignments and reflections organized, it also serves as a one stop communication platform within the cohort and instructor.</li>\n<li>If you are a self-directed learner who likes to lead, you can create a learning journey as a path for the novices in the field to get their journey started and get the basics right.</li>\n</ol>\n</li>\n<li>Harness the power of online and multimedia resources\n<ol>\n<li>Using a learning journey designer can help you integrate various learning sources and materials.</li>\n</ol>\n</li>\n<li>Bring learners across geo-locations to interact together in one space. Proponents of blended learning argue that incorporating the \"asynchronous Internet communication technology\" into higher education courses serves to \"facilitate a simultaneous independent and collaborative learning experience\" (Garrison &amp; Kanuka, 2004).</li>\n<li>Community building: The virtual learning environment helps connect instructors with learners without physically being present, thus making this a 'virtual cafe'. Many schools use the online tool for online classes, classwork, question &amp; answer forums, and other school related work. Blended learning yielded positive results from the online community. These results were comparable to that of Alcoholics Anonymous and Weight Watchers (Bradford et al., 2007).</li>\n<li>Best of both worlds:  <a href=\"https://www.slideshare.net/panopto/do-flipped-classrooms-work-new-student-performance-data-panopto-video-platform\">Studies have shown</a> “blended learning” reduces failure rates, improves learning, and boosts engagement (Cramer et al., 2007; Day &amp; Foley, 2006; Hunsu et al., 2016). Blended learning promises the best of both worlds. It integrates the best aspects of face-to-face teaching and online instruction in ways that enable students to learn at their own pace. For exa mple, a student in a blended learning course who masters a concept earlier than his peers can move on without having to wait, and conversely, a student who needs more time is not forced to move forward before fully grasping the subject. It is proving to be a <a href=\"https://www.theatlantic.com/politics/archive/2015/09/new-data-backs-blended-learning/432894/\">scalable learning model that simply works</a> for diverse populations of students (Journal, 2015) .</li>\n<li><strong>No one left behind: </strong>Blended learning takes every type of learner into account, whether they prefer the familiar traditional classroom, would rather learn online, or try a mixture of both. Skipping the limitations of a classroom or an all-online course, blended learning utilizes a variety of methodologies so the content can be customized to the learner and optimized for the subject matter. Though, not everything from face-to-face training is easily translated to digital content, it’s still possible to re-engineer existing content for online delivery in a way that complements the existing training.</li>\n<li><strong>Learning Trends and Feedback</strong>\n<ol>\n<li>Instructors using blended learning can quickly adopt the latest learning trends and modalities into the curriculum. They utilise the built-in reporting features in most LMS software programs for deeper, data driven insights into learner progress and success.</li>\n<li>From learner’s perspective, a unique opportunity emerges to discuss, model, and practice their new skills in a safe space. They’re not just watching or hearing—they’re doing. By applying the new knowledge shortly after leaving the physical or virtual classroom, learners retain better.</li>\n</ol>\n</li>\n</ol>\n<ol start=\"9\">\n<li><strong>Fun and Engagement </strong></li>\n</ol>\n<p>Blended learning is a highly interactive experience. Learners reinforce the offline lessons by practicing online through a variety of different content media, each crafted to suit a certain learning style. Learners choose which type of content to interact with, practice what they learn, and communicate with instructors and other learners on their own time and on any device. The community experience keeps learners engaged and informs teachers about their progress and areas needing more attention.</p>\n<ol start=\"10\">\n<li><strong>Lower Costs </strong></li>\n</ol>\n<p><br>In-class training might come across as cheaper than eLearning development. But the true cost of face-to-face sessions is high: Time away from work, paying instructors, and flying in remote employees can take up significant amount of the learning budget. A blended eLearning approach minimises on travel costs and can be re-used, which reduces instructor time as well.</p>\n<p> </p>\n<p> </p>\n<h1>Conclusion</h1>\n<p>Online learning offers personalized, self-paced learning with <a href=\"https://elmlearning.com/learning-solutions/custom-elearning/\">eLearning</a> components that lend themselves to interactive media such as games, videos, tutorials, quizzes and social media components, all accessible from the learner’s home page in the Learning Management System (LMS)—and accessible from the learner’s smartphone or tablet.</p>\n<p>Blended learning happens when we combine live physical learning events with digital counterpart. The digital platform like learning weaver provides a scaffolding for the learner to contextualize their learning environment. In today’s hybrid world it is important to create a room or a space where the learning experience is placed and hosted. Mind you it doesn’t need to become a social network and doesn’t need to foster more than required engagement among the learners. For that learners already have a lot of tools. Instead, this needs to be focused space where the learners can just be with the facilitator or leader and engage with the material.</p>\n<p>The gamification or the leader board provides the social angle to the learning it creates the motivation and urgency to master and engage in the material. Without it the self-paced nature might be good for some highly motivated learners but for others it might become something which they sign on but never use it back again.</p>\n<p> </p>\n<h1>Links and References:</h1>\n<p> </p>\n<p><a href=\"https://elmlearning.com/blog/blended-learning-everything-need-know/\">What is Blended Learning? Examples &amp; More | ELM Learning</a></p>\n<p><a href=\"https://leolearning.com/blended-virtual-learning/blended-learning/#:~:text=What%20Is%20Blended%20Learning%3F,the%20minutiae%20of%20the%20design.\">Blended Learning: Create the Perfect Learner Journey | LEO Learning | LEO Learning</a></p>\n<p><a href=\"https://www.theatlantic.com/politics/archive/2015/09/new-data-backs-blended-learning/432894/\">New Data Backs Blended Learning - The Atlantic</a></p>\n<p><a href=\"https://studioassets.blob.core.windows.net/production/0-DCA/content/white-paper-and-ebook/english/Optimizing%20the%20Learning%20Journey%20for%20Soft%20Skills.pdf\">Optimizing the Learning Journey for Soft Skills.pdf (windows.net)</a></p>\n<p><a href=\"http://jite.org/documents/Vol5/v5p235-249Heinze156.pdf\">Online Communication and IT education (jite.org)</a></p>\n<p> </p>\n<p>Bradford, P., Porciello, M., Balkon, N., &amp; Backus, D. (2007). The Blackboard Learning System: The Be All and End All in Educational Instruction? <em>Journal of Educational Technology Systems</em>, <em>35</em>(3), 301–314. https://doi.org/10.2190/X137-X73L-5261-5656</p>\n<p>Cramer, K., Collins, K., Snider, D., &amp; Fawcett, G. (2007). The Virtual Lecture Hall: Utilisation, effectiveness and student perceptions. <em>British Journal of Educational Technology</em>, <em>38</em>, 106–115. https://doi.org/10.1111/j.1467-8535.2006.00598.x</p>\n<p>Day, J., &amp; Foley, J. (2006). Evaluating web lectures: A case study from HCI. <em>CHI ’06 Extended Abstracts on Human Factors in Computing Systems</em>, 195–200. https://doi.org/10.1145/1125451.1125493</p>\n<p>Garrison, D. R., &amp; Kanuka, H. (2004). Blended learning: Uncovering its transformative potential in higher education. <em>The Internet and Higher Education</em>, <em>7</em>(2), 95–105. https://doi.org/10.1016/j.iheduc.2004.02.001</p>\n<p>Hunsu, N. J., Adesope, O., &amp; Bayly, D. J. (2016). A meta-analysis of the effects of audience response systems (clicker-based technologies) on cognition and affect. <em>Computers &amp; Education</em>, <em>94</em>, 102–119. https://doi.org/10.1016/j.compedu.2015.11.013</p>\n<p>Journal, E. D., National. (2015, September 23). <em>New Data Backs Blended Learning</em>. The Atlantic. https://www.theatlantic.com/politics/archive/2015/09/new-data-backs-blended-learning/432894/</p>\n<p>Neelen, M., &amp; Kirschner, P. A. (n.d.). Evidence-Informed Learning Design. <em>Learning Design</em>, 328.</p>\n<p>Siemens, G., Gašević, D., &amp; Dawson, S. (2015). <em>Preparing for the Digital University: A Review of the History and Current State of Distance, Blended and Online Learning</em>. https://research.monash.edu/en/publications/preparing-for-the-digital-university-a-review-of-the-history-and-</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "image": "https://learningweaver.com/media/posts/23/hunter-newton-FQe4hjBlcPE-unsplash.jpg",
            "author": {
                "name": "Madhur Anand"
            },
            "tags": [
                   "blog"
            ],
            "date_published": "2022-10-04T12:13:00+05:30",
            "date_modified": "2022-10-16T12:16:37+05:30"
        },
        {
            "id": "https://learningweaver.com/privacy/",
            "url": "https://learningweaver.com/privacy/",
            "title": "Privacy Policy",
            "summary": "LearningWeaver (“we,” “our,” or “us”) is committed to protecting your&hellip;",
            "content_html": "<p>LearningWeaver (“we,” “our,” or “us”) is committed to protecting your privacy. This Privacy Policy explains how your personal information is collected, used, and disclosed by LearningWeaver.<br><br>This Privacy Policy applies to our website, and its associated subdomains (collectively, our “Service”) alongside our application, LearningWeaver. By accessing or using our Service, you signify that you have read, understood, and agree to our collection, storage, use, and disclosure of your personal information as described in this Privacy Policy and our Terms of Service.<br><br><strong>Definitions and key terms</strong><br><br>To help explain things as clearly as possible in this Privacy Policy, every time any of these terms are referenced, are strictly defined as:<br><br><strong>Cookie:</strong> small amount of data generated by a website and saved by your web browser. It is used to identify your browser, provide analytics, remember information about you such as your language preference or login information.<br><strong>Company:</strong> when this policy mentions “Company,” “we,” “us,” or “our,” it refers to Transcendix Partners LLP, (No. 69, 16th Main, 4th Block, Koramangala. Bengaluru – 560034) that is responsible for your information under this Privacy Policy.<br><strong>Country:</strong> where LearningWeaver or the owners/founders of LearningWeaver are based, in this case is India.<br><strong>Customer:</strong> refers to the company, organization or person that signs up to use the LearningWeaver Service to manage the relationships with your consumers or service users.<br><strong>Device:</strong> any internet connected device such as a phone, tablet, computer or any other device that can be used to visit LearningWeaver and use the services.<br><strong>IP address:</strong> Every device connected to the Internet is assigned a number known as an Internet protocol (IP) address. These numbers are usually assigned in geographic blocks. An IP address can often be used to identify the location from which a device is connecting to the Internet.<br><strong>Personnel:</strong> refers to those individuals who are employed by LearningWeaver or are under contract to perform a service on behalf of one of the parties.<br><strong>Personal Data:</strong> any information that directly, indirectly, or in connection with other information — including a personal identification number — allows for the identification or identifiability of a natural person.<br><strong>Service:</strong> refers to the service provided by LearningWeaver as described in the relative terms (if available) and on this platform.<br><strong>Third-party service:</strong> refers to advertisers, contest sponsors, promotional and marketing partners, and others who provide our content or whose products or services we think may interest you.<br><strong>Website:</strong> LearningWeaver site, which can be accessed via this URL: https://LearningWeaver.com/partners/hdfclife<br><strong>You:</strong> a person or entity that is registered with LearningWeaver to use the Services.<br><br><strong>What information do we collect?</strong><br><br>We may collect the following information from you when you visit our website, register on our site, place an order, subscribe to our newsletter, respond to a survey or fill out a form:Name / UsernamePhone NumbersEmail AddressesJob TitlesAgePassword<br><strong><br>How do we use the information we collect?</strong><br>Any of the information we collect from you may be used in one of the following ways:To personalize your experience (your information helps us to better respond to your individual needs)To improve our website (we continually strive to improve our website offerings based on the information and feedback we receive from you)To improve customer service (your information helps us to more effectively respond to your customer service requests and support needs)To process transactionsTo administer a contest, promotion, survey or other site featureTo send periodic emails<br><br><strong>When does LearningWeaver use end user information from third parties?</strong><br>LearningWeaver will collect End User Data necessary to provide the LearningWeaver services to our customers.<br><br>End users may voluntarily provide us with information they have made available on social media websites. If you provide us with any such information, we may collect publicly available information from the social media websites you have indicated. You can control how much of your information social media websites make public by visiting these websites and changing your privacy settings.<br><br><br><strong>When does LearningWeaver use customer information from third parties?</strong><br>We receive some information from the third parties when you contact us. For example, when you submit your email address to us to show interest in becoming a LearningWeaver customer, we receive information from a third party that provides automated fraud detection services to LearningWeaver. We also occasionally collect information that is made publicly available on social media websites. You can control how much of your information social media websites make public by visiting these websites and changing your privacy settings.<br><br><br><strong>Do we share the information we collect with third parties?</strong><br>We may share the information that we collect, both personal and non-personal, with third parties such as advertisers, contest sponsors, promotional and marketing partners, and others who provide our content or whose products or services we think may interest you. We may also share it with our current and future affiliated companies and business partners, and if we are involved in a merger, asset sale or other business reorganization, we may also share or transfer your personal and non-personal information to our successors-in-interest.<br><br>We may engage trusted third party service providers to perform functions and provide services to us, such as hosting and maintaining our servers and the website, database storage and management, e-mail management, storage marketing, credit card processing, customer service and fulfilling orders for products and services you may purchase through the website. We will likely share your personal information, and possibly some non-personal information, with these third parties to enable them to perform these services for us and for you.We may share portions of our log file data, including IP addresses, for analytics purposes with third parties such as web analytics partners, application developers, and ad networks. If your IP address is shared, it may be used to estimate general location and other technographics such as connection speed, whether you have visited the website in a shared location, and type of the device used to visit the website. They may aggregate information about our advertising and what you see on the website and then provide auditing, research and reporting for us and our advertisers.<br><br>We may also disclose personal and non-personal information about you to government or law enforcement officials or private parties as we, in our sole discretion, believe necessary or appropriate in order to respond to claims, legal process (including subpoenas), to protect our rights and interests or those of a third party, the safety of the public or any person, to prevent or stop any illegal, unethical, or legally actionable activity, or to otherwise comply with applicable court orders, laws, rules and regulations.<br><br><br><strong>Where and when is information collected from customers and end users?</strong><br>LearningWeaver will collect personal information that you submit to us. We may also receive personal information about you from third parties as described above.<br><br><br><strong>How do we use your email address?</strong><br>By submitting your email address on this website, you agree to receive emails from us. You can cancel your participation in any of these email lists at any time by clicking on the opt-out link or other unsubscribe option that is included in the respective email. We only send emails to people who have authorized us to contact them, either directly, or through a third party. We do not send unsolicited commercial emails, because we hate spam as much as you do. By submitting your email address, you also agree to allow us to use your email address for customer audience targeting on sites like Facebook, where we display custom advertising to specific people who have opted-in to receive communications from us. Email addresses submitted only through the order processing page will be used for the sole purpose of sending you information and updates pertaining to your order. If, however, you have provided the same email to us through another method, we may use it for any of the purposes stated in this Policy. Note: If at any time you would like to unsubscribe from receiving future emails, we include detailed unsubscribe instructions at the bottom of each email.<br><br><br><strong>How long do we keep your information?</strong><br>We keep your information only so long as we need it to provide LearningWeaver to you and fulfill the purposes described in this policy. This is also the case for anyone that we share your information with and who carries out services on our behalf. When we no longer need to use your information and there is no need for us to keep it to comply with our legal or regulatory obligations, we’ll either remove it from our systems or depersonalize it so that we can’t identify you.<br><br><br><strong>How do we protect your information?</strong><br>We implement a variety of security measures to maintain the safety of your personal information when you place an order or enter, submit, or access your personal information. We offer the use of a secure server. All supplied sensitive/credit information is transmitted via Secure Socket Layer (SSL) technology and then encrypted into our Payment gateway providers database only to be accessible by those authorized with special access rights to such systems, and are required to keep the information confidential. After a transaction, your private information (credit cards, social security numbers, financials, etc.) is never kept on file. We cannot, however, ensure or warrant the absolute security of any information you transmit to LearningWeaver or guarantee that your information on the Service may not be accessed, disclosed, altered, or destroyed by a breach of any of our physical, technical, or managerial safeguards.<br><br><br><strong>Could my information be transferred to other countries?</strong><br>LearningWeaver is incorporated in India. Information collected via our website, through direct interactions with you, or from use of our help services may be transferred from time to time to our offices or personnel, or to third parties, located throughout the world, and may be viewed and hosted anywhere in the world, including countries that may not have laws of general applicability regulating the use and transfer of such data. To the fullest extent allowed by applicable law, by using any of the above, you voluntarily consent to the trans-border transfer and hosting of such information.<br><br><br><strong>Is the information collected through the LearningWeaver Service secure?</strong><br>We take precautions to protect the security of your information. We have physical, electronic, and managerial procedures to help safeguard, prevent unauthorized access, maintain data security, and correctly use your information. However, neither people nor security systems are foolproof, including encryption systems. In addition, people can commit intentional crimes, make mistakes or fail to follow policies. Therefore, while we use reasonable efforts to protect your personal information, we cannot guarantee its absolute security. If applicable law imposes any non-disclaimable duty to protect your personal information, you agree that intentional misconduct will be the standards used to measure our compliance with that duty.<br><br><br><strong>Can I update or correct my information?</strong><br>The rights you have to request updates or corrections to the information LearningWeaver collects depend on your relationship with LearningWeaver. Personnel may update or correct their information as detailed in our internal company employment policies.<br><br>Customers have the right to request the restriction of certain uses and disclosures of personally identifiable information as follows. You can contact us in order to (1) update or correct your personally identifiable information, (2) change your preferences with respect to communications and other information you receive from us, or (3) delete the personally identifiable information maintained about you on our systems (subject to the following paragraph), by cancelling your account. Such updates, corrections, changes and deletions will have no effect on other information that we maintain, or information that we have provided to third parties in accordance with this Privacy Policy prior to such update, correction, change or deletion. To protect your privacy and security, we may take reasonable steps (such as requesting a unique password) to verify your identity before granting you profile access or making corrections. You are responsible for maintaining the secrecy of your unique password and account information at all times.<br><br>You should be aware that it is not technologically possible to remove each and every record of the information you have provided to us from our system. The need to back up our systems to protect information from inadvertent loss means that a copy of your information may exist in a non-erasable form that will be difficult or impossible for us to locate. Promptly after receiving your request, all personal information stored in databases we actively use, and other readily searchable media will be updated, corrected, changed or deleted, as appropriate, as soon as and to the extent reasonably and technically practicable.<br><br>If you are an end user and wish to update, delete, or receive any information we have about you, you may do so by contacting the organization of which you are a customer.<br><br><br><strong>Personnel</strong><br>If you are a LearningWeaver worker or applicant, we collect information you voluntarily provide to us. We use the information collected for Human Resources purposes in order to administer benefits to workers and screen applicants.<br><br>You may contact us in order to (1) update or correct your information, (2) change your preferences with respect to communications and other information you receive from us, or (3) receive a record of the information we have relating to you. Such updates, corrections, changes and deletions will have no effect on other information that we maintain, or information that we have provided to third parties in accordance with this Privacy Policy prior to such update, correction, change or deletion.<br><br><br><strong>Sale of Business</strong><br>We reserve the right to transfer information to a third party in the event of a sale, merger or other transfer of all or substantially all of the assets of LearningWeaver or any of its Corporate Affiliates (as defined herein), or that portion of LearningWeaver or any of its Corporate Affiliates to which the Service relates, or in the event that we discontinue our business or file a petition or have filed against us a petition in bankruptcy, reorganization or similar proceeding, provided that the third party agrees to adhere to the terms of this Privacy Policy.<br><br><br><strong>Affiliates</strong><br>We may disclose information (including personal information) about you to our Corporate Affiliates. For purposes of this Privacy Policy, “Corporate Affiliate” means any person or entity which directly or indirectly controls, is controlled by or is under common control with LearningWeaver, whether by ownership or otherwise. Any information relating to you that we provide to our Corporate Affiliates will be treated by those Corporate Affiliates in accordance with the terms of this Privacy Policy.<br><br><br><strong>Governing Law</strong><br>This Privacy Policy is governed by the laws of India without regard to its conflict of laws provision. You consent to the exclusive jurisdiction of the courts in connection with any action or dispute arising between the parties under or in connection with this Privacy Policy except for those individuals who may have rights to make claims under Privacy Shield, or the Swiss-US framework.<br><br>The laws of India, excluding its conflicts of law rules, shall govern this Agreement and your use of the website. Your use of the website may also be subject to other local, state, national, or international laws.<br><br>By using LearningWeaver or contacting us directly, you signify your acceptance of this Privacy Policy. If you do not agree to this Privacy Policy, you should not engage with our website, or use our services. Continued use of the website, direct engagement with us, or following the posting of changes to this Privacy Policy that do not significantly affect the use or disclosure of your personal information will mean that you accept those changes.<br><br><br><strong>Your Consent</strong><br>We’ve updated our Privacy Policy to provide you with complete transparency into what is being set when you visit our site and how it’s being used. By using our website, registering an account, or making a purchase, you hereby consent to our Privacy Policy and agree to its terms.<br><br><br><strong>Links to Other Websites</strong><br>This Privacy Policy applies only to the Services. The Services may contain links to other websites not operated or controlled by LearningWeaver. We are not responsible for the content, accuracy or opinions expressed in such websites, and such websites are not investigated, monitored or checked for accuracy or completeness by us. Please remember that when you use a link to go from the Services to another website, our Privacy Policy is no longer in effect. Your browsing and interaction on any other website, including those that have a link on our platform, is subject to that website’s own rules and policies. Such third parties may use their own cookies or other methods to collect information about you.<br><br><br><strong>Cookies</strong><br>LearningWeaver uses “Cookies” to identify the areas of our website that you have visited. A Cookie is a small piece of data stored on your computer or mobile device by your web browser. We use Cookies to enhance the performance and functionality of our website but are non-essential to their use. However, without these cookies, certain functionality like videos may become unavailable or you would be required to enter your login details every time you visit the website as we would not be able to remember that you had logged in previously. Most web browsers can be set to disable the use of Cookies. However, if you disable Cookies, you may not be able to access functionality on our website correctly or at all. We never place Personally Identifiable Information in Cookies.<br><br><br><strong>Blocking and disabling cookies and similar technologies</strong><br>Wherever you’re located you may also set your browser to block cookies and similar technologies, but this action may block our essential cookies and prevent our website from functioning properly, and you may not be able to fully utilize all of its features and services. You should also be aware that you may also lose some saved information (e.g. saved login details, site preferences) if you block cookies on your browser. Different browsers make different controls available to you. Disabling a cookie or category of cookie does not delete the cookie from your browser, you will need to do this yourself from within your browser, you should visit your browser’s help menu for more information.<br><br><strong>Payment Details</strong><br>In respect to any credit card or other payment processing details you have provided us, we commit that this confidential information will be stored in the most secure manner possible.<br><br><br><strong>Kids’ Privacy</strong><br>We do not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.<br><br><br><strong>Changes To Our Privacy Policy</strong><br>We may change our Service and policies, and we may need to make changes to this Privacy Policy so that they accurately reflect our Service and policies. Unless otherwise required by law, we will notify you (for example, through our Service) before we make changes to this Privacy Policy and give you an opportunity to review them before they go into effect. Then, if you continue to use the Service, you will be bound by the updated Privacy Policy. If you do not want to agree to this or any updated Privacy Policy, you can delete your account.<br><br><br><strong>Third-Party Services</strong><br>We may display, include or make available third-party content (including data, information, applications and other products services) or provide links to third-party websites or services (“Third- Party Services”).<br>You acknowledge and agree that LearningWeaver shall not be responsible for any Third-Party Services, including their accuracy, completeness, timeliness, validity, copyright compliance, legality, decency, quality or any other aspect thereof. LearningWeaver does not assume and shall not have any liability or responsibility to you or any other person or entity for any Third-Party Services.<br>Third-Party Services and links thereto are provided solely as a convenience to you and you access and use them entirely at your own risk and subject to such third parties’ terms and conditions.<br><br><br><strong>Tracking Technologies</strong><br><strong>Cookies <br></strong>We use Cookies to enhance the performance and functionality of our website but are non-essential to their use. However, without these cookies, certain functionality like videos may become unavailable or you would be required to enter your login details every time you visit the website as we would not be able to remember that you had logged in previously.<strong>Local Storage</strong>Local Storage sometimes known as DOM storage, provides web apps with methods and protocols for storing client-side data. Web storage supports persistent data storage, similar to cookies but with a greatly enhanced capacity and no information stored in the HTTP request header.<br><br><strong>Sessions</strong><br>LearningWeaver uses “Sessions” to identify the areas of our website that you have visited. A Session is a small piece of data stored on your computer or mobile device by your web browser.<br><br><br><strong>Information about General Data Protection Regulation (GDPR)</strong><br>We may be collecting and using information from you if you are from the European Economic Area (EEA), and in this section of our Privacy Policy we are going to explain exactly how and why is this data collected, and how we maintain this data under protection from being replicated or used in the wrong way.<br><br><br><strong>What is GDPR?</strong><br>GDPR is an EU-wide privacy and data protection law that regulates how EU residents’ data is protected by companies and enhances the control the EU residents have, over their personal data.<br><br>The GDPR is relevant to any globally operating company and not just the EU-based businesses and EU residents. Our customers’ data is important irrespective of where they are located, which is why we have implemented GDPR controls as our baseline standard for all our operations worldwide.<br><br><br><strong>What is personal data?</strong><br>Any data that relates to an identifiable or identified individual. GDPR covers a broad spectrum of information that could be used on its own, or in combination with other pieces of information, to identify a person. Personal data extends beyond a person’s name or email address. Some examples include financial information, political opinions, genetic data, biometric data, IP addresses, physical address, sexual orientation, and ethnicity.<br><br><br>The Data Protection Principles include requirements such as:<br><br>Personal data collected must be processed in a fair, legal, and transparent way and should only be used in a way that a person would reasonably expect.Personal data should only be collected to fulfil a specific purpose and it should only be used for that purpose. Organizations must specify why they need the personal data when they collect it.Personal data should be held no longer than necessary to fulfil its purpose.People covered by the GDPR have the right to access their own personal data. They can also request a copy of their data, and that their data be updated, deleted, restricted, or moved to another organization.<br><br><br><strong>Why is GDPR important?</strong><br>GDPR adds some new requirements regarding how companies should protect individuals’ personal data that they collect and process. It also raises the stakes for compliance by increasing enforcement and imposing greater fines for breach. Beyond these facts it’s simply the right thing to do. At LearningWeaver we strongly believe that your data privacy is very important and we already have solid security and privacy practices in place that go beyond the requirements of this new regulation.<br><br><br><strong>Individual Data Subject’s Rights – Data Access, Portability and Deletion</strong><br>We are committed to helping our customers meet the data subject rights requirements of GDPR. LearningWeaver processes or stores all personal data in fully vetted, DPA compliant vendors. We do store all conversation and personal data for up to 6 years unless your account is deleted. In which case, we dispose of all data in accordance with our Terms of Service and Privacy Policy, but we will not hold it longer than 60 days.<br><br>We are aware that if you are working with EU customers, you need to be able to provide them with the ability to access, update, retrieve and remove personal data. We got you! We’ve been set up as self service from the start and have always given you access to your data and your customers data. Our customer support team is here for you to answer any questions you might have about working with the API.<br><br><strong>California Residents</strong><br>The California Consumer Privacy Act (CCPA) requires us to disclose categories of Personal Information we collect and how we use it, the categories of sources from whom we collect Personal Information, and the third parties with whom we share it, which we have explained above.<br><br>We are also required to communicate information about rights California residents have under California law. You may exercise the following rights:<br><strong>Right to Know and Access.</strong> You may submit a verifiable request for information regarding the: (1) categories of Personal Information we collect, use, or share; (2) purposes for which categories of Personal Information are collected or used by us; (3) categories of sources from which we collect Personal Information; and (4) specific pieces of Personal Information we have collected about you.<br><strong>Right to Equal Service.</strong> We will not discriminate against you if you exercise your privacy rights.<br><strong>Right to Delete.</strong> You may submit a verifiable request to close your account and we will delete Personal Information about you that we have collected.Request that a business that sells a consumer’s personal data, not sell the consumer’s personal data.If you make a request, we have one month to respond to you. If you would like to exercise any of these rights, please contact us.We do not sell the Personal Information of our users.For more information about these rights, please contact us.</p>",
            "image": "https://learningweaver.com/media/posts/20/privacy.jpg",
            "author": {
                "name": "Madhur Anand"
            },
            "tags": [
            ],
            "date_published": "2022-09-14T19:35:26+05:30",
            "date_modified": "2022-09-14T19:37:07+05:30"
        },
        {
            "id": "https://learningweaver.com/custom-blended-learning-journeys-at-uno-minda/",
            "url": "https://learningweaver.com/custom-blended-learning-journeys-at-uno-minda/",
            "title": "Custom Blended Learning Journeys at Uno Minda",
            "summary": "<p>In March 2021, Uno Minda conducted an online assessment centre with over 90 high potential talent in supervisory and first-time manager roles. </p>\n",
            "content_html": "<p>In March 2021, Uno Minda conducted an online assessment centre with over 90 high potential talent in supervisory and first-time manager roles. </p>\n\n<h3><strong>Blended learning journey plan</strong></h3>\n<p>The idea was to provide a comprehensive and systematic developmental journey to build critical competency areas that were identified through the assessment centre.</p>\n<p>90 participants had to be divided into 4 different learning tracks based on the results of the assessment centre.</p>\n<figure class=\"post__image\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/19/ascend-1-2.gif\" alt=\"\" width=\"660\" height=\"378\"></figure><br><br>The LearningWeaver platform was leveraged to design, deliver, and administer the 4 learning tracks. Each track was divided into 4 milestones. Each milestone had a custom blended learning plan with a mix of instructional modalities – games, simulations, live workshops, and action plans.</p>\n<figure class=\"post__image\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/19/ascend-2.gif\" alt=\"\" width=\"660\" height=\"378\"></figure>\n<p><br>The program also leveraged the platforms gamification component through a point and leaderboard system. This enhanced the engagement of learners throughout the 12-month long learning journey.</p>\n<h3><strong>Success metrics</strong></h3>\n<p>The program received an overall engagement score of 94%. 78 participants graduated out of the program. The program also delivered an overall 81% proficiency score.</p>\n<figure class=\"post__image\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/19/scoreboard-1-2.gif\" alt=\"\" width=\"670\" height=\"375\"></figure>\n<h3><strong>About Uno Minda</strong></h3>\n<p>Making its mark in the International Grid of Automobile Components manufacturing, UNO MINDA steers ahead as a leading Tier 1 supplier of Proprietary Automotive Solutions to Original Equipment Manufacturers (OEMs).<br>Incepted way back in 1958 with a meagre start-up capital and now notching up a group turnover beyond US$ 1 Billion, speaks volumes of the conglomerate that it is today.</p>",
            "image": "https://learningweaver.com/media/posts/19/lw-minda.png",
            "author": {
                "name": "Madhur Anand"
            },
            "tags": [
                   "case-study"
            ],
            "date_published": "2022-09-14T19:14:59+05:30",
            "date_modified": "2022-09-20T10:27:43+05:30"
        },
        {
            "id": "https://learningweaver.com/hdfc/",
            "url": "https://learningweaver.com/hdfc/",
            "title": "LearningWeaver Powers The First Time Managers Journey at HDFC Bank",
            "summary": "<p>The LearningWeaver platform is powering Trailblaze, an intense 6-weeks learning journey for First Time Managers at HDFC Bank.     </p>\n",
            "content_html": "<p>The LearningWeaver platform is powering Trailblaze, an intense 6-weeks learning journey for First Time Managers at HDFC Bank.     </p>\n\n<p><br><br>The learning journey, jointly designed by the HDFC Bank L&amp;D team and Skills Café and delivered using the LearningWeaver platform is helping young and new managers at the bank in embracing the challenges that come with the new role.    </p>\n<h3><strong>Blended learning journey plan</strong></h3>\n<p>Participants work through a blended learning plan that is divided into 4 milestones. Each milestone is mapped to a variety of learning modalities including podcasts, curated Youtube videos, live workshops, graded action plans, and group reflection sessions.</p>\n<figure class=\"post__image\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/18/trailblaze-1.gif\" alt=\"\" width=\"660\" height=\"378\"></figure><br><br>The journey includes topics like People First Mindset, Systematic People Development, Giving Feedback, and Networking and Stakeholder Management.<br><br>The journey has stringent completion criterion with participants required to complete mandatory activities and complete action plans that are graded. All participants who meet the completion criterion are awarded a certificate at the end of the program.</p>\n<figure class=\"post__image\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/18/trailblaze-2.gif\" alt=\"\" width=\"660\" height=\"378\"></figure><br><br>The program also leverages gamification to increase learner participation. A mix of proficiency and completion scores make up a learner score card and learners are listed on a leader board based on their scorecards.<br><br>The LearningWeaver platform is the backbone for this program. The platform provides an intense learning experience to participants and at the same time ensures that all stakeholders receive timely reports and program metrics.</p>\n<h3><strong>Success metrics</strong></h3>\n<p>The platform is also highly rated by learners and has received an overall satisfaction score of 4.6/5 while generating score of 4.8/5 on application of learning. Both metrics are closely linked with blended learning plan that the program delivers.</p>\n<figure class=\"post__image\"><img decoding=\"async\" loading=\"lazy\"  src=\"https://learningweaver.com/media/posts/18/admin-1.gif\" alt=\"\" width=\"660\" height=\"378\"></figure><br><br>The Trailblaze program will cover 200+ participants in 10 batches over the next 12 months.</p>\n<h3><strong>About HDFC Bank</strong></h3>\n<p>HDFC Bank is one of India’s leading private banks and was among the first to receive approval from the Reserve Bank of India (RBI) to set up a private sector bank in 1994.<br><br>Today, HDFC Bank has a banking network of 6,378 branches and 18,620 ATM's in 3,203 cities/towns.</p>",
            "image": "https://learningweaver.com/media/posts/18/lw-hdfc.webp",
            "author": {
                "name": "Madhur Anand"
            },
            "tags": [
                   "case-study"
            ],
            "date_published": "2022-09-14T19:14:14+05:30",
            "date_modified": "2022-09-20T10:47:58+05:30"
        }
    ]
}
